{
  "datalayer-details-help": "<h2>What is datalayer?</h2> \n The datalayer is a JavaScript object that contains variables and values that can be used to transmit relevant information through tags configured in GTM. For example, when a user makes a purchase on a website, information about that transaction can be sent to the datalayer, such as the transaction ID, total purchase amount, purchased products, etc. GTM tags can then use this information stored in the datalayer to track events, such as sales conversions, and send data to analytics tools like Google Analytics or other third-party tracking platforms. \n <h2>What is datalayer declaration?</h2> refers to the process of defining and structuring a datalayer on a website. This involves creating a JavaScript object that will contain the variables and values necessary to transmit specific information about events and actions on the website. In the context of Google Tag Manager (GTM), a datalayer declaration is essential for establishing a consistent and organized structure for data collection. By declaring a datalayer, variables to store important information are defined, such as transaction information on an e-commerce site, button click events, form submissions, etc. \n <h2>What is datalayer push?</h2> \n refers to the action of adding data to the datalayer on a website using JavaScript. When a datalayer push is performed, specific variables and values are inserted into the datalayer to transmit information about events or actions occurring on the website. In the context of Google Tag Manager (GTM) and other online analytics and tracking tools, datalayer push is a way to send structured data from the website to the datalayer for use by tags configured in GTM. \n <h2>What is datalayer ecommerce?</h2> \n is a data structure specifically designed to collect information related to transactions and ecommerce events on a website. This structure is commonly used in conjunction with analytics and tracking tools like Google Tag Manager (GTM) and Google Analytics to track and analyze user behavior during the online purchasing process. The ecommerce datalayer typically includes variables and values that capture important details about transactions, such as the transaction ID, total purchase amount, purchased products, currency used, product category, quantity of products purchased, etc. This data is structured in a way that is understandable and uses a specific syntax so that it can be easily interpreted by analytics tools."
}
